tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/0.orig/beam_0/W
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      DW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    right
    {
        // type    fixedValue;
        // value   uniform (0 0 0);
        type    forceBeamDisplacementNR;
        force   uniform (0 0 0);
        value   uniform (0 0 0);
    }

    left
    {
        type    fixedValue;
        value   uniform (0 0 0);
        // type    fixedDisplacement;
        // displacementSeries
        // {
        //     file        "$FOAM_CASE/constant/timeVsDisplacement";
        //     outOfBounds     clamp;
        // }
        // value   uniform (0 0 0);
    }

    beam
    {
        type    empty;
    }
}


// ************************************************************************* //
