tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/0.orig/beam_0/pointW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       pointVectorField;
    location    "0";
    object      pointW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
324
(
(0.0098 -0.0002 0)
(0.0102 0.0002 0)
(0.0102 0.0002 0)
(0.0098 -0.0002 0)
(0.0097 -0.0001 0)
(0.0101 0.0003 0)
(0.0101 0.0003 0)
(0.0097 -0.0001 0)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
    }
    right
    {
        type            calculated;
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
