tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/0.orig/beam_0/refLambdaf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceTensorField;
    location    "0";
    object      refLambdaf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (2.22045e-16 -1 0 1 2.22045e-16 0 0 0 1);

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (2.22045e-16 -1 0 1 2.22045e-16 0 0 0 1);
    }
    right
    {
        type            calculated;
        value           uniform (2.22045e-16 -1 0 1 2.22045e-16 0 0 0 1);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
