tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/0.orig/beam_0/refW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      refW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
80
(
(0.00995 5e-05 0)
(0.00985 0.00015 0)
(0.00975 0.00025 0)
(0.00965 0.00035 0)
(0.00955 0.00045 0)
(0.00945 0.00055 0)
(0.00935 0.00065 0)
(0.00925 0.00075 0)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    right
    {
        type            calculated;
        value           uniform (0.002 0.008 0);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
