tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/0.orig/beam_0/refWf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "0";
    object      refWf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
79
(
(0.0099 0.0001 0)
(0.0098 0.0002 0)
(0.0097 0.0003 0)
(0.0096 0.0004 0)
(0.0095 0.0005 0)
(0.0094 0.0006 0)
(0.0093 0.0007 0)
(0.0092 0.0008 0)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (0.01 0 0);
    }
    right
    {
        type            calculated;
        value           uniform (0.002 0.008 0);
    }
    beam
    {
        type            empty;
    }
}


// ************************************************************************* //
