tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions


runApplication blockMesh

restore0Dir
touch case.foam
#runApplication pimpleFoam

runApplication  decomposePar -latestTime


for beamI in constant/beam*
    do
        cp constant/cellDecomposition.beams $beamI/cellDecomposition
        beamNameI=$(basename $beamI)
        runApplication -s $beamNameI decomposePar -region $beamNameI -latestTime
    done

runParallel pimpleFoam

runApplication reconstructPar #-latestTime

for beamI in constant/beam*
    do
        beamNameI=$(basename $beamI)
        runApplication -s $beamNameI reconstructPar -region $beamNameI #-latestTime
    done



#------------------------------------------------------------------------------
