tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/constant/beam_0/beamProperties
/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      beamProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

beamModel coupledTotalLagNewtonRaphsonBeam;

// nBeams 1;

// R R [0 1 0 0 0 0 0] 0.000106;//3.17E-04;
// L L [0 1 0 0 0 0 0] 0.008;//0.005;
// nSegments 80;

beams
(
    beam_0
    {
        crossSectionModel rectangle;

        // circleCrossSectionModelDict
        // {
        //     radius 0.000106;
        // }

        // length 0.008;
        // nSegments 80;
        rectangleCrossSectionModelDict
        {
            b 0.0004;//0.000212;
            h 0.0004;//0.000212;
            nx 1;
            ny 1;
            // scalingSecondMomentArea 0.4;
        }         
        length 0.008;
        nSegments 80;
    }
);

"coupledTotalLagNewtonRaphsonBeamCoeffs"
{
    // Zhang/Liu/Khoo 2012, sec 6.4, Case 1: E=1e5 g/(cm s^2) = 1e4 Pa, nu=0.3
    E E [1 -1 -2 0 0 0 0] 1e4;
    G G [1 -1 -2 0 0 0 0] 3846.15;
    rho rho [1 -3 0 0 0 0 0] 7800;
    rhoFluid rhoFluid [1 -3 0 0 0 0 0] 1000;
    //- convergence check paramters----------------
    nCorrectors 500;
    residualTol 1e-09;//1e-08;//1e-07;//1e-06;
    solutionTol 1e-10;//1e-09;//1e-08;//1e-07;
    absoluteTol 1e-10;//1e-10;//1e-09;//1e-08;
    divergenceTol  1e6;

    
    // ALM parameters moved to constant/beamMomentumContributionProperties
}



// ************************************************************************* //
