tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/constant/beam_0/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    left
    {
        type            patch;
        nFaces          1;
        startFace       79;
    }
    right
    {
        type            patch;
        nFaces          1;
        startFace       80;
    }
    beam
    {
        type            empty;
        inGroups        1(empty);
        nFaces          320;
        startFace       81;
    }
)

// ************************************************************************* //
