tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/constant/beam_0/timeVsDisplacement
(
    ( 0 (0 0 0))
    ( 2 (-0.024 -0.0773479 -0.051))

)
