tutorial/beamFluidInteractionCases/beamTunnel/beamTunnel/constant/beam_0/timeVsMoment
(
    ( 0 ( 0 0 0 ) )
    ( 2 ( 0 0 0) )  //2.5pi=7.85398

)
